---
kind: method
id: M:Autodesk.Revit.DB.Lighting.InitialLuminousIntensity.#ctor(Autodesk.Revit.DB.Lighting.InitialLuminousIntensity)
source: html/1819d280-124f-c50c-1d07-95fd714f1cfd.htm
---
# Autodesk.Revit.DB.Lighting.InitialLuminousIntensity.#ctor Method

Creates a copy of the given initial luminous intensity object

## Syntax (C#)
```csharp
public InitialLuminousIntensity(
	InitialLuminousIntensity other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.InitialLuminousIntensity`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null